import { Course } from "@/types/course";

const coursesDataOff: Course[] = [
  {
    id: 1,
    title: "Колористика від 0 до про!",
    author: {
      name: "Alina",
      image: "/images/kursy/alina-pic.jpg",
      designation: "Колористка",
      tags: ["fryzjerstwo", "Lite"],
    },
    image: "/images/blog/blog-01.jpg",
    subtitle:
      "Колористика - серйозна наука, яка не терпить зайвих експериментів і помилок.",
    subtitledetail: " У вартість включено: всі модулі, іспит та сертифікат!",
    paragraph:
      "Розробленний мною курс фарбування волосся допоможе вам оволодіти різноманітними техніками фарбування волосся, від базових до просунутих методів!",
    benefitstitle: "Які переваги принесе вам наш офлайн-курс?",
    benefits: [
      {
        id: 1,
        title: "Ви отримаєте ґрунтовну теоретичну базу:",
        description:
          "вивчите теорію кольору, кольорознавство та психологію кольору.",
      },
      {
        id: 2,
        title: "Ви вивчите різноманітні техніки фарбування:",
        description:
          "від класичних методів до сучасних технік та креативних і просунутих способів фарбування волосся.",
      },
      {
        id: 3,
        title: "Ви опануєте практичні навички:",
        description:
          "Ви дізнаєтеся, як правильно підготувати волосся до фарбування, які інструменти та засоби необхідні для цього, як корегувати та виправляти колір.",
      },
    ],
    suitableFor: [
      {
        id: 1,
        paragraph:
          "Перукарі-початківці, які бажають отримати міцну основу в колористиці.",
      },
      {
        id: 2,
        paragraph:
          "Досвідчені стилісти, які бажають розширити свої навички та освоїти новітні техніки.",
      },
      {
        id: 3,
        paragraph:
          "Любителі фарбування волосся, які бажають отримати професійні знання.",
      },
    ],
    desc: [
      {
        id: 1,
        paragraph:
          "Курс фарбування волосся включає в себе знання теорії кольору, аналіз кольору, мелірування, бейбілайт, техніки балаяжу, а також навички нанесення фарби, знебарвлення, тонування волосся та фіксації кольору.",
      },
      {
        id: 2,
        paragraph:
          "Обирайте перевірені знання, які постійно оновлюються відповідно до потреб курсу та змін у трендах колористики. Вивчайте новітні техніки, такі як AirTouch, Foilayage, Flamboyage, Palm Painting та Shadow Root. Курс фарбування волосся - ідеальний вступ до започаткування власного перукарського бізнесу",
      },
      {
        id: 3,
        paragraph:
          "Після курсу ви зможете ефективно фарбувати волосся, створювати модні та сучасні кольори волосся, а також керувати відносинами з клієнтами та просувати свої послуги. Ви навчитеся консультувати клієнтів, керувати часом і роботою в салоні, застосовувати сучасні методи маркетингу та просування.",
      },
    ],
    actualcourse: "Курс є актуальним на 2025 рік",
    data: "10/01/2025",
    publishDate: "12/01/2025",
    sidebar: {
      title: "Вартість курсу",
      price: "8000",
      description: [
        {
          list: "opis",
        },
        {
          list: "opis1",
        },
      ],
      information: [
        {
          name: "Модулі",
          quantity: "10",
          image: "/images/icon/clock.svg",
        },
        {
          name: "Лекції",
          quantity: "15",
          image: "/images/icon/book.png",
        },
        {
          name: "Тести",
          quantity: "12",
          image: "/images/icon/icons8.png",
        },
        {
          name: "Сектифікат",
          quantity: "",
          image: "/images/icon/icons1.png",
        },
        {
          name: "Необмежений доступ",
          quantity: "",
          image: "/images/icon/icons2.png",
        },
        {
          name: "Екзамен",
          quantity: "",
          image: "/images/icon/icons8.png",
        },
      ],
    },
    authorDesignation: "Alina",
    authorName: "Alina",
    authorTags: undefined,
    authorImage: "/images/kursy/alina-pic.jpg",
  },
  {
    id: 2,
    title: "Колористика від 0 до про!",
    subtitle:
      "Колористика - серйозна наука, яка не терпить зайвих експериментів і помилок.",
    subtitledetail: " У вартість включено: всі модулі, іспит та сертифікат!",
    paragraph:
      "Розробленний мною курс фарбування волосся допоможе вам оволодіти різноманітними техніками фарбування волосся, від базових до просунутих методів!",
    benefitstitle: "Які переваги принесе вам наш офлайн-курс?",
    benefits: [
      {
        id: 1,
        title: "Ви отримаєте ґрунтовну теоретичну базу:",
        description:
          "вивчите теорію кольору, кольорознавство та психологію кольору.",
      },
      {
        id: 2,
        title: "Ви вивчите різноманітні техніки фарбування:",
        description:
          "від класичних методів до сучасних технік та креативних і просунутих способів фарбування волосся.",
      },
      {
        id: 3,
        title: "Ви опануєте практичні навички:",
        description:
          "Ви дізнаєтеся, як правильно підготувати волосся до фарбування, які інструменти та засоби необхідні для цього, як корегувати та виправляти колір.",
      },
    ],
    suitableFor: [
      {
        id: 1,
        paragraph:
          "Перукарі-початківці, які бажають отримати міцну основу в колористиці.",
      },
      {
        id: 2,
        paragraph:
          "Досвідчені стилісти, які бажають розширити свої навички та освоїти новітні техніки.",
      },
      {
        id: 3,
        paragraph:
          "Любителі фарбування волосся, які бажають отримати професійні знання.",
      },
    ],
    desc: [
      {
        id: 1,
        paragraph:
          "Курс фарбування волосся включає в себе знання теорії кольору, аналіз кольору, мелірування, бейбілайт, техніки балаяжу, а також навички нанесення фарби, знебарвлення, тонування волосся та фіксації кольору.",
      },
      {
        id: 2,
        paragraph:
          "Обирайте перевірені знання, які постійно оновлюються відповідно до потреб курсу та змін у трендах колористики. Вивчайте новітні техніки, такі як AirTouch, Foilayage, Flamboyage, Palm Painting та Shadow Root. Курс фарбування волосся - ідеальний вступ до започаткування власного перукарського бізнесу",
      },
      {
        id: 3,
        paragraph:
          "Після курсу ви зможете ефективно фарбувати волосся, створювати модні та сучасні кольори волосся, а також керувати відносинами з клієнтами та просувати свої послуги. Ви навчитеся консультувати клієнтів, керувати часом і роботою в салоні, застосовувати сучасні методи маркетингу та просування.",
      },
    ],
    actualcourse: "Курс є актуальним на 2025 рік",
    image: "/images/blog/blog-01.jpg",
    data: "10/01/2025",
    publishDate: "12/01/2025",
    author: {
      name: "Alina",
      image: "/images/kursy/alina-pic.jpg",
      designation: "Колористка",
      tags: ["fryzjerstwo", "Lite"],
    },
    sidebar: {
      title: "Вартість курсу",
      price: "8000",
      description: [
        {
          list: "opis",
        },
        {
          list: "opis1",
        },
      ],
      information: [
        {
          name: "Модулі",
          quantity: "10",
          image: "/images/icon/clock.svg",
        },
        {
          name: "Лекції",
          quantity: "15",
          image: "/images/icon/book.png",
        },
        {
          name: "Тести",
          quantity: "12",
          image: "/images/icon/icons8.png",
        },
        {
          name: "Сектифікат",
          quantity: "",
          image: "/images/icon/icons1.png",
        },
        {
          name: "Необмежений доступ",
          quantity: "",
          image: "/images/icon/icons2.png",
        },
        {
          name: "Екзамен",
          quantity: "",
          image: "/images/icon/icons8.png",
        },
      ],
    },
    authorDesignation: "Alina",
    authorName: "Alina",
    authorTags: undefined,
    authorImage: "/images/kursy/alina-pic.jpg",
  },
  {
    id: 3,
    title: "Колористика від 0 до про!",
    subtitle:
      "Колористика - серйозна наука, яка не терпить зайвих експериментів і помилок.",
    subtitledetail: " У вартість включено: всі модулі, іспит та сертифікат!",
    paragraph:
      "Розробленний мною курс фарбування волосся допоможе вам оволодіти різноманітними техніками фарбування волосся, від базових до просунутих методів!",
    benefitstitle: "Які переваги принесе вам наш офлайн-курс?",
    benefits: [
      {
        id: 1,
        title: "Ви отримаєте ґрунтовну теоретичну базу:",
        description:
          "вивчите теорію кольору, кольорознавство та психологію кольору.",
      },
      {
        id: 2,
        title: "Ви вивчите різноманітні техніки фарбування:",
        description:
          "від класичних методів до сучасних технік та креативних і просунутих способів фарбування волосся.",
      },
      {
        id: 3,
        title: "Ви опануєте практичні навички:",
        description:
          "Ви дізнаєтеся, як правильно підготувати волосся до фарбування, які інструменти та засоби необхідні для цього, як корегувати та виправляти колір.",
      },
    ],
    suitableFor: [
      {
        id: 1,
        paragraph:
          "Перукарі-початківці, які бажають отримати міцну основу в колористиці.",
      },
      {
        id: 2,
        paragraph:
          "Досвідчені стилісти, які бажають розширити свої навички та освоїти новітні техніки.",
      },
      {
        id: 3,
        paragraph:
          "Любителі фарбування волосся, які бажають отримати професійні знання.",
      },
    ],
    desc: [
      {
        id: 1,
        paragraph:
          "Курс фарбування волосся включає в себе знання теорії кольору, аналіз кольору, мелірування, бейбілайт, техніки балаяжу, а також навички нанесення фарби, знебарвлення, тонування волосся та фіксації кольору.",
      },
      {
        id: 2,
        paragraph:
          "Обирайте перевірені знання, які постійно оновлюються відповідно до потреб курсу та змін у трендах колористики. Вивчайте новітні техніки, такі як AirTouch, Foilayage, Flamboyage, Palm Painting та Shadow Root. Курс фарбування волосся - ідеальний вступ до започаткування власного перукарського бізнесу",
      },
      {
        id: 3,
        paragraph:
          "Після курсу ви зможете ефективно фарбувати волосся, створювати модні та сучасні кольори волосся, а також керувати відносинами з клієнтами та просувати свої послуги. Ви навчитеся консультувати клієнтів, керувати часом і роботою в салоні, застосовувати сучасні методи маркетингу та просування.",
      },
    ],
    actualcourse: "Курс є актуальним на 2025 рік",
    image: "/images/blog/blog-01.jpg",
    data: "10/01/2025",
    publishDate: "12/01/2025",
    author: {
      name: "Alina",
      image: "/images/kursy/alina-pic.jpg",
      designation: "Колористка",
      tags: ["fryzjerstwo", "Lite"],
    },
    sidebar: {
      title: "Вартість курсу",
      price: "8000",
      description: [
        {
          list: "opis",
        },
        {
          list: "opis1",
        },
      ],
      information: [
        {
          name: "Модулі",
          quantity: "10",
          image: "/images/icon/clock.svg",
        },
        {
          name: "Лекції",
          quantity: "15",
          image: "/images/icon/book.png",
        },
        {
          name: "Тести",
          quantity: "12",
          image: "/images/icon/icons8.png",
        },
        {
          name: "Сектифікат",
          quantity: "",
          image: "/images/icon/icons1.png",
        },
        {
          name: "Необмежений доступ",
          quantity: "",
          image: "/images/icon/icons2.png",
        },
        {
          name: "Екзамен",
          quantity: "",
          image: "/images/icon/icons8.png",
        },
      ],
    },
    authorDesignation: "Alina",
    authorName: "Alina",
    authorTags: undefined,
    authorImage: "/images/kursy/alina-pic.jpg",
  },
];
export default coursesDataOff;
