"use client";
import React, { useState } from "react";
const OnlineCourses = () => {
  const [isExpanded, setIsExpanded] = useState(false);

  const toggleExpand = () => {
    setIsExpanded(!isExpanded);
  };
  return (
    <div className="container mt-20">
      <div className=" flex flex-col w-full items-center  justify-center px-4 py-4 text-gray-800 dark:text-white shadow-2xl">
        <div
          className={`text-base leading-relaxed md:text-lg ${
            isExpanded ? "" : "line-clamp-3"
          } mb-2`}
        >
          <h1 className="mb-6 text-center text-2xl font-bold md:text-3xl">
            Як народилася ідея онлайн-навчання
          </h1>
          <p className="mb-4 text-base leading-relaxed md:text-lg">
            Я завжди вважала, що час — це один із найцінніших ресурсів, який у
            нас є. Але лише після багатьох років навчання та самовдосконалення я
            по-справжньому зрозуміла, наскільки це правда. Я проходила різні
            курси, тренінги, майстер-класи, багато чого навчилася, але з кожним
            роком дедалі більше усвідомлювала, скільки часу йде на дорогу, на
            підготовку, на те, щоб знайти вільний момент для навчання.
          </p>
          <p className="mb-4 text-base leading-relaxed md:text-lg">
            І ось тоді я зрозуміла, що маю зробити щось, що дозволить людям,
            які, як і я, хочуть розвиватися, але не мають можливості витрачати
            час на поїздки чи відвідування офлайн-курсових занять, мати
            можливість навчатися онлайн.
          </p>
          <p className="mb-4 text-base leading-relaxed md:text-lg">
            Я вирішила створити курси, які будуть доступні кожному, де б він не
            знаходився. Моїм першим кроком стала ідея розробити курси для
            майбутніх перукарів-колористів. Це сфера, яка завжди мене цікавила,
            і я знаю, наскільки важливо навчитися в ній майстерно працювати. Але
            саме через нестачу часу і можливостей багато людей не можуть зайти
            на цей шлях і реалізувати свої мрії. Саме для таких людей я хочу
            створити онлайн-курси, щоб кожен мав шанс отримати потрібні знання
            та навички, не покидаючи свій дім чи роботу.
          </p>
          <p className="mb-4 text-base leading-relaxed md:text-lg">
            Мої курси — це не просто уроки, це можливість для кожного відкрити
            нові горизонти, втілити мрії та досягти того, чого раніше здавалось
            неможливим. Вони допоможуть не тільки освоїти перукарське мистецтво,
            але й відчути впевненість у своїх силах. Час, якого раніше не
            вистачало, тепер можна ефективно використовувати для саморозвитку. Я
            впевнена, що ці курси допоможуть багатьом людям змінити своє життя,
            отримавши можливість працювати в такій цікавій і креативній сфері,
            як перукарство та колорування.
          </p>
          <p className="text-base leading-relaxed md:text-lg">
            Якщо ви, як і я, відчуваєте, що час — це не просто абстрактне
            поняття, а реальна цінність, то я запрошую вас приєднатися до моїх
            курсів. Давайте разом збудуємо нове майбутнє, де навчання — це
            доступний і ефективний процес, а час, який ми витрачаємо, приносить
            максимальну користь.
          </p>
        </div>
        <button
          onClick={toggleExpand}
          className="hover:bg-bg-primary/80 mt-5 rounded-lg bg-primary px-4 py-2 text-white transition mr-auto"
        >
          {isExpanded ? "закрити" : "читати далі"}
        </button>
      </div>
    </div>
  );
};

export default OnlineCourses;
